{"modelTopology":{"class_name":"Sequential","config":{"name":"sequential_1","layers":[{"class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1","trainable":true,"batch_input_shape":[null,4],"dtype":"float32"}},{"class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2","trainable":true}},{"class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3","trainable":true}}]},"keras_version":"tfjs-layers 4.22.0","backend":"tensor_flow.js"},"weightSpecs":[{"name":"dense_Dense1/kernel","shape":[4,32],"dtype":"float32"},{"name":"dense_Dense1/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense2/kernel","shape":[32,16],"dtype":"float32"},{"name":"dense_Dense2/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense3/kernel","shape":[16,1],"dtype":"float32"},{"name":"dense_Dense3/bias","shape":[1],"dtype":"float32"}],"weightData":"wrbLvvNFkz9AApc+Mx2DP1c0HcDqR9W+t0cFv07jfj3QRZa+RS4WwKo4N706BjK/fQF1vZiiUL/XATW/575tvgFmwj49X38/pY8qPihR477jUU4/tRMiPDg9Db6NTDU/7WzdvPS11T5rjRS8wGI2PRUJQ777D0U/G9HBu2yVdb5zBau9CHumPnyXej7xn9i++CQIPoRBmr2LyIy8tiSSvjjhp70UkI28pWNKvAEy4rx7HgI+rDixvffHTD39a2k8PALTvjLrtr7XFnW++zPRvcMPj74g3ni+ITMzPut/xT5T3Ns9XfgwPpfeeD6zzzS+GhiRPuG1mL7HQWo/KZwMvhvLZ70ddAy/x4fiPsH75766w1S9Fr6FPcOqtj05o3+9CJmLPiNJO71m97q7VQ6OPcPEHr5bgPm9Wl/XvGBOS76b6R0+XP/AvmR+Rr3xN5G9vouXvh2NHD9y05G+N4Qnv6+ypb4R9Xq+qMqaPtzKiT4hkJk+5g6ivugfEj5oF0g+RfJwvRTrSL6Vr5A9S4ahPuoMl75IJ5o+JGIyvIe3xL5/eOE+UaTevcefcT6A/pI8MGu4Pg/U377AchW+85eQPWYbvjzvJaq+wffYvbjB+L2D1Zw9XnlLPgXrtT5DzvY7SAB6PgrY372dqg67F6yRPmjz+L2PB1q9FxT8PbxNnr76H4g9P7T6vb8lAL6y5VG++oQAPpYjmj1dd7s9bNthPsBbAz6xa3M+mzF4vI5y5z0YHwE+h1AEPoRg8T2Q1rs9Z5TAPRu6Pb4EGjY+Hjj+PQLNGb400l47eGRXOACCmr2cyUA+Ht05PmoDJT7gh30+7+1cPhGTGL4DtQS8OOVSPpB6Wz7BbWc+haOlvsp+4j24mV0+f5ZSPscpKLxicxu9LmgwPp77Mj64+Ao+ADmCvglEMr4hUze+sYIXvjlqIL5TSIQ9d0IjPTFl4b3Mj569abmaPtecHT4vLCo+vLKQPgBzR75DPAzAoH9svuKI5rxzDM67nqQcvvE++D0E8CC+YDEqPjGVHT1EKx6+8kMAvkk+sb7B2QjAe8ddvjKTlD6YGjg+EzqfPqn/zL+dBgy6Ygpdvky9fT23Nig+nwrCvTHzkb0OT1e+hHMrvgfV7j0alFa+O8iuPq5cv7ttnis+BkjQvrFV3b42Qpc+BOj2PWflDL8O6dq9GCPTvjzTcT6a2v8+OtI/PzeXhL1Q2nY+5liHPUahBsByR4A+sFMWPu5JCj9SowDAx8vpPqhV1b3YfV0/6P2lvdgYQT7K8VQ+qupcvegTAL2caxQ+KHEwvv3Zir5sWYk+DeZRvoyb6b5OCuM82YQgPsQxpL207eC9ejTAPi+2I77c3kq+DgE5vufFTz5C2TK+EbaHvoYO+r0lKOi93oI0PqqphL5kQ5q+oW3KPjP3zj4OdE0+IOmivly5cT3B83y9DJDjPdU5+73VgZ87LmzEPui6nb5dVXi+sM/OvfsbZTxM/+A9cyaJvumhbT4vdwU+t99BPh3vxb3/2Go+JhAPPTydtj5g1OE9Df5DPg9SBb6+Jna9TvoPPTPPVj7FrBU+8TnSPWN3iD7RNZ4+dufnPm92yj35nYC+h0cGP6YrEj4OLW+9ANWqPMrYp0CumZpA0mUdPgvSOb38lSU6QtEdPWHugr51ccW+RWifQOuYnsA53mi/5q7qvXN0l0Dmz0O+956VQCg8SzyQbFO+C9sCPVCgoT7QLQI+OMndvNoHxz3HVpY+AddjPtWiFz7Xc6E93MCgPVKWzT2lwYC9vzJYO1xZH77Vdio8eDviPDaCEzwPc4e+ySupPkQJKr5AxUI9R7C8PQly2D2suIg+MSrIPvocuT4/qJm+k1LSvaQcHb4pDo4+H4jEvkZ79T15MZ0+RI1xvhtz670Uy3u+hN0jPkeDwj3AASa+JHzYPUpSsr01wq8+r63FvV894rz4Bk8+Ag6YvTClJL7ST2i98vC0vPeOtD4PihM+UHksvmAKH7xo5w0+aVeXvrjkdj0Ivic/oW6XPnCAab3NlSI+n1FdvpckmL7jM2y9E5//vN1RZT6R+Ca+wv+6vYYogb4ppUS9lVnave1GND2eA7a+ykKtPkWCqD6dFZ++ZXTEvZLT5L6bazE+g19KvS8iDL5YEhy+cTyLPEQ4qzq0SQS+231ZPtpAHD12Xo4919cGPoiIML4rOfs+l9TrPHiuFz793gq+IQwfPrJAA76CpBW9YHp+PoruBD1WmnG+TFhVvh39qD54Zfu9FUI6PhNRmz5S3eM9Nu6DPislNz3Zt64+OpZTPYDFXryM0J0+fpETv+4V0r5AMro+rQ+ZPuYOtz5ddBw/jimcvrQyt7w2GeK+xLvHvjmULT9vg3a9GrL2vQtDiL7AmhS/+HYBvHPvcD45BUy8dSQCvgaAtr3ff5U8/Q6OPvTGyT0M/NK+NHJyPk5Jkj5qeC09fn6fPHHA8j4WJmQ+kKATPtWRAL50CQM+MPyDvgnd7b03/qe+wdhQPgMRpD7eO+S96GKgviOQAj75MBQ9s7AyvI1bub6kvkI+XtOUPulcuD2WWwC+p2AOv7qJ5Tw87XO+v/ZPPhHcGr2QDAI+ngG0PY4n271C7iS/yYwQvo2BVD5mWXo7XAcZv1m5JD6IYJ46ZXLDvi+fpzyWqH6+jOWUPXhHVD5nPCm+LakGvAYFtju1LDe+dzVEvusLMT7AnCI//swAvskY9r745BE9I2Pnvdn0Db07pAE+SEsOPr8qhb1Kb7k9EUOhvf3yK75pgZW+60N2vi5icr7kszO/7WiVPoEMOr7fB9G+jlHlPJ52W7zjvBS+kH1cvlW02b7ngh2922dhvkMmur1YVHc+bF4MPkVj8b18qnW8vHI0wF1bBj9rXKO8Z00YvvIVpDxonoS+wo8CvmV6ED7ucgE9FIyBvsHWUTzulbO+QdSvPnfxhr7Rx54+8UoKPtrhMr9ZfKQ+P5QbPjVf/Tl8OwW9Mcq+PmBcU72FYLY9xPaCPg+pYj5Jg608ny/5vQVlaD7xDSq+FHdTvhbU5T6d2Ji+Eg0lPqmV0j0OPLC9xiS/PUFWaz67GLO9W+p8PbETUj663pi+f24qvm+mDT58Tz/Afr0wPhKqBT1eyWk+MR1APmQ/Yb6UGEk+LObZPZLNdL2I6wS9NhSEPYgjUj4cFII+o/1bPipBNr6ZzpW+K4c/Pqd8jb6rJRa+mAywPhz5zj5xmLW+RBDYPO0OwD4I3OO9qflCPYT+wr00+r8+DxZ7PmrlFT4O8Z6+BGOKvXAaF8D9nxG+sCxSPWHriz7L1pY+QkldvZCbhr5Mqa08QkoGvSOqvz18CYO86VkovosaVb7V1AC9AEXMviTZX71F+sA+BEhZvpo+BT7Hbtu+xaYOvnUw1T6wkq87VpFEvkS1DT75dc2+waQsvRicp774u9O+3ZztPUlPND7QCwW+9cy0vh66pb39qSa+dpjRvgoPrz53g+8+awItvtspAL+6i/48kmtyPGJJGD5UaG4+0pixPcygyr6W2Q49xRgtvsH8Zb5O2+I9/CStveeXgD5oMMo+Bd5EvtPpez6eiac+acuIvkvfBT07iW++rMKCPnJLkD4KhDu9IQXIPIaaOrxP8EY8H1tgvU18Jr1hNpM+TZa1PXB6T736oaG9mNeNPhwbe73csY8+IpFivcBewj61kRA/RJIBvgQ83zzPW0q+nBMHv3eDD7+nbJY7ZVwhP1LUg7+yBMq+OCGUvZGhET+8Wvm9+JDlPlI4Ub7wqqc+"}